InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_НомерТелефона</Name>
					<Comment>Поле в котором хранится числовое значение телефонного номера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПКО</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствРозничнаяВыручка</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПодотчетником</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхДенежныхСредствВБанке</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация/Ext/ManagerModule.bsl
Функция ПолучитьДляТерминала(Запрос, НомерТелефона, TransactionId,ReceiptNumber, QueryType = "check") Экспорт  
	
	ResultCode = "21";
	ResultStatus = "Error";
	ResultMessage = "Заказы не найдены";
	OrdersCount = 0;
	OrdersXML = "";
	
	Попытка
		
		Если QueryType = "check" Тогда
			
			Заказы = Документы.ЗаказПокупателя.ПолучитьЗаказыДляОплатыТерминалом(НомерТелефона);
			
			Если Заказы <> Неопределено И Заказы.Количество() > 0 Тогда
				
				ResultCode = "0";
				ResultStatus = "Success";
				ResultMessage = "";
				OrdersCount = Заказы.Количество();
				
				OrdersXML = "<Orders>";
				
				Для Каждого СтрЗаказ Из Заказы Цикл
					OrdersXML = OrdersXML 
						+ Документы.ЗаказПокупателя.ПолучитьОтветПоЗакамДляОплатыВТерминале(СтрЗаказ, НомерТелефона);
				КонецЦикла;
				
				OrdersXML = OrdersXML + "</Orders>";
				
			КонецЕсли;
			
		ИначеЕсли QueryType = "pay" Тогда

			OrderId = Запрос.ПараметрыЗапроса.Получить("OrderId");
			Amount  = Запрос.ПараметрыЗапроса.Получить("Amount");

			Если ПустаяСтрока(OrderId) Тогда

				ResultCode = "21";
				ResultStatus = "Error";
				ResultMessage = "Не передан OrderId";

			ИначеЕсли ПустаяСтрока(Amount) Тогда

				ResultCode = "21";
				ResultStatus = "Error";
				ResultMessage = "Не передана сумма оплаты";

			Иначе

				OrderGUID = Новый УникальныйИдентификатор(OrderId);
				ЗаказСсылка = Документы.ЗаказПокупателя.ПолучитьСсылку(OrderGUID);

				Если ЗаказСсылка = Неопределено Или ЗаказСсылка.Пустая() Тогда

					ResultCode = "21";
					ResultStatus = "Error";
					ResultMessage = "Заказ не найден";

				Иначе

					// проверка суммы
					СуммаОплаты = Число(СтрЗаменить(Amount, ".", ","));

					Если СуммаОплаты <= 0 Тогда

						ResultCode = "241";
						ResultStatus = "Error";
						ResultMessage = "Некорректная сумма оплаты";

					Иначе

						Комментарий =
						"Оплата через терминал. "
						+ Документы.ПриходныйКассовыйОрдер.МаркерТранзакцииТерминала(TransactionId)
						+ " ReceiptNumber: " + Строка(ReceiptNumber)
						+ "; OrderId: " + Строка(OrderId)
						+ "; Account: " + Строка(НомерТелефона);

						ПКООплаты = Документы.ПриходныйКассовыйОрдер.НайтиПКОПоТранзакцииТерминала(
							TransactionId, Перечисления.ВидыОперацийПКО.ОплатаПокупателя);

						Если ПКООплаты <> Неопределено Тогда

							ResultCode = "0";
							ResultStatus = "Success";
							ResultMessage = "Платеж уже был принят ранее";

						Иначе

							ПКО = Документы.ПриходныйКассовыйОрдер.СоздатьПКО(ЗаказСсылка, СуммаОплаты, Комментарий, "Г00000031", Ложь);

							Попытка

								ПКО.Записать(РежимЗаписиДокумента.Проведение);

								ResultCode = "0";
								ResultStatus = "Success";
								ResultMessage = "Платеж принят";

							Исключение

								ResultCode = "2";
								ResultStatus = "Error";
								ResultMessage = "Ошибка создания оплаты: " + ОписаниеОшибки();

							КонецПопытки;

						КонецЕсли;

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

		ИначеЕсли QueryType = "change" Тогда

			// Второй запрос по тому же чеку. Основной платеж уже проведен и чек напечатан,
			// и только после этого клиент выбирает, куда девать решту - в один запрос
			// с оплатой это не укладывается.
			//
			// Куда именно, говорит ServiceID: соответствие номера кассе и действию ведется
			// в ПриходныйКассовыйОрдер.НастройкаСервисаСдачи, так что терминалу не нужно
			// знать ни кодов касс, ни статей ДДС.
			//
			// ChangeId метит ордера решты отдельно от оплаты: у переплаты тот же вид
			// операции, что у платежа, и общий маркер заставил бы дедуп считать ее дублем.

			OrderId   = Запрос.ПараметрыЗапроса.Получить("OrderId");
			Amount    = Запрос.ПараметрыЗапроса.Получить("Amount");
			ServiceID = Запрос.ПараметрыЗапроса.Получить("ServiceID");

			Сервис = Документы.ПриходныйКассовыйОрдер.НастройкаСервисаСдачи(ServiceID);

			СуммаСдачи = 0;
			Если Не ПустаяСтрока(Amount) Тогда
				СуммаСдачи = Число(СтрЗаменить(Amount, ".", ","));
			КонецЕсли;

			Если ПустаяСтрока(OrderId) Тогда

				ResultCode = "21";
				ResultStatus = "Error";
				ResultMessage = "Не передан OrderId";

			ИначеЕсли ПустаяСтрока(ServiceID) Тогда

				ResultCode = "21";
				ResultStatus = "Error";
				ResultMessage = "Не передан ServiceID";

			ИначеЕсли Сервис = Неопределено Тогда

				ResultCode = "21";
				ResultStatus = "Error";
				ResultMessage = "Неизвестный ServiceID: " + Строка(ServiceID);

			ИначеЕсли СуммаСдачи <= 0 Тогда

				ResultCode = "241";
				ResultStatus = "Error";
				ResultMessage = "Некорректная сумма сдачи";

			Иначе

				OrderGUID = Новый УникальныйИдентификатор(OrderId);
				ЗаказСсылка = Документы.ЗаказПокупателя.ПолучитьСсылку(OrderGUID);

				Если ЗаказСсылка = Неопределено Или ЗаказСсылка.Пустая() Тогда

					ResultCode = "21";
					ResultStatus = "Error";
					ResultMessage = "Заказ не найден";

				Иначе

					Комментарий =
					Сервис.Наименование + ". "
					+ Документы.ПриходныйКассовыйОрдер.МаркерСдачиТерминала(TransactionId)
					+ " ServiceID: " + Строка(ServiceID)
					+ "; ReceiptNumber: " + Строка(ReceiptNumber)
					+ "; OrderId: " + Строка(OrderId)
					+ "; Account: " + Строка(НомерТелефона);

					ВидОперацииСдачи = ?(Сервис.Действие = "Благотворительность",
						Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее,
						Перечисления.ВидыОперацийПКО.ОплатаПокупателя);

					ПКОСдачи = Документы.ПриходныйКассовыйОрдер.НайтиПКОПоТранзакцииТерминала(
						TransactionId, ВидОперацииСдачи, "ChangeId");

					Если ПКОСдачи <> Неопределено Тогда

						ResultCode = "0";
						ResultStatus = "Success";
						ResultMessage = "Решта вже була прийнята раніше";

					Иначе

						Попытка

							Если Сервис.Действие = "Благотворительность" Тогда

								ПКО = Документы.ПриходныйКассовыйОрдер.СоздатьПКОБлаготворительность(
									ЗаказСсылка, СуммаСдачи, Комментарий,
									Сервис.КассаКод, Сервис.СтатьяДДСКод, Ложь);

							Иначе

								// Заказ уже оплачен, поэтому решта ложится по нему переплатой.
								// Пустить ее в следующий заказ можно переносом задолженности -
								// ЗаказПокупателя.ЗачестьПереплатуНаЗаказ.
								ПКО = Документы.ПриходныйКассовыйОрдер.СоздатьПКО(
									ЗаказСсылка, СуммаСдачи, Комментарий, Сервис.КассаКод, Ложь);

							КонецЕсли;

							ПКО.Записать(РежимЗаписиДокумента.Проведение);

							ResultCode = "0";
							ResultStatus = "Success";
							ResultMessage = "Решта прийнята";

						Исключение

							ResultCode = "2";
							ResultStatus = "Error";
							ResultMessage = "Не прийнята решта: " + ОписаниеОшибки();

						КонецПопытки;

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;


		Иначе
			
			ResultCode = "299";
			ResultStatus = "Error";
			ResultMessage = "Неподдерживаемый QueryType";
			
		КонецЕсли;
		
	Исключение
		
		ResultCode = "2";
		ResultStatus = "Error";
		ResultMessage = ОписаниеОшибки();
		OrdersCount = 0;
		OrdersXML = "";
		
	КонецПопытки;
	
	XML = 
	"<?xml version=""1.0"" encoding=""UTF-8""?>" + Символы.ПС +
	"<Response>" +
	"<TransactionId>" + XMLСтрока(TransactionId) + "</TransactionId>" +
	"<ResultCode>" + XMLСтрока(ResultCode) + "</ResultCode>" +
	"<ResultStatus>" + XMLСтрока(ResultStatus) + "</ResultStatus>" +
	"<ResultMessage>" + XMLСтрока(ResultMessage) + "</ResultMessage>" +
	"<OrdersCount>" + XMLСтрока(Строка(OrdersCount)) + "</OrdersCount>" +
	OrdersXML +
	"<Comment></Comment>" +
	"</Response>";
	
	Возврат XML;
	
КонецФункции
